/* ======================================================== */
/*				AbsFramework Common							*/
/* ======================================================== */
EditBoxUndoAction_0 = "Typing";
EditBoxUndoAction_1 = "Delete";
EditBoxUndoAction_2 = "Delete";
EditBoxUndoAction_3 = "Delete";
EditBoxUndoAction_4 = "Cut";
EditBoxUndoAction_5 = "Paste";
EditBoxUndoAction_6 = "Drag&Drop";
EditBoxUndoAction_Undo = "Undo ^0";
EditBoxUndoAction_Redo = "Redo ^0";
EditBoxUndoAction_UndoDisabled = "Undo";
EditBoxUndoAction_RedoDisabled = "Redo";
EditBoxUndoAction_GeneralUndo = "Undo";
EditBoxUndoAction_GeneralRedo = "Redo";
PrintCancelDialog = "Printing ^0";
DefaultFontTitle = "( Default Font )";


/* ======================================================== */
/*				Menu Strings								*/
/* ======================================================== */

/* Window Menu */
WindowMenu_Switch = "Switch Windows in order";

/* Input Backslash */
InputBackslash_InputBackslash = "Input \\";
InputBackslash_InputYen = "Input ¥";

/* Cross Caret */
CrossCaret_Show = "Show Cross-Caret";
CrossCaret_Hide = "Hide Cross-Caret";

/* File List */
FileList_Show = "Show File List Window";
FileList_Hide = "Hide File List Window";

/* Rect Select */
RectSelect_Off = "Set OFF Rectangle Select Mode";
RectSelect_On = "Set ON Rectangle Select Mode";

/* TabMode */
TabMode_Off = "Set OFF Tab Mode";
TabMode_On = "Set ON Tab Mode";

/* キー記録 */
KeyRecordWindow_Show = "Show Key Record/Play Window";
KeyRecordWindow_Hide = "Hide Key Record/Play Window";

/* FTPLog */
FTPLog_Show = "Show FTP Log Window";
FTPLog_Hide = "Hide FTP Log Window";

/* Fusen List */
FusenList_Show = "Show Sticky List Window";
FusenList_Hide = "Hide Sticky List Window";

/* Jump List */
JumpList_Show = "Show Header List";
JumpList_Hide = "Hide Header List";

/* ID Info Window */
IdInfo_Show = "Show Identifier Info Window";
IdInfo_Hide = "Hide Identifier Info Window";

/* Transliterate */
Transliterate_ChangeCaseLower = "Uppercase->Lowercase";
Transliterate_ChangeCaseUpper = "Lowercase->Uppercase";

/* Return code menu */
ReturnCodeMenu_CR = "CR (Legacy Mac)";
ReturnCodeMenu_CRLF = "CR+LF (Windows)";
ReturnCodeMenu_LF = "LF (Mac/UNIX)";

/* Wrap mode menu */
WrapModeMenu_NoWrap = "No Wrap";
WrapModeMenu_WordWrapByWindowWidth = "Word Wrap with Window Width";
WrapModeMenu_WordWrapByLetterCount = "Word Wrap with Characters Count...";
WrapModeMenu_LetterWrapByWindowWidth = "Character Wrap with Window Width";
WrapModeMenu_LetterWrapByLetterCount = "Character Wrap with Characters Count...";

/* Undo Action */
UndoAction_0 = "Typing";
UndoAction_1 = "Delete";
UndoAction_2 = "Delete";
UndoAction_3 = "Delete";
UndoAction_4 = "Cut";
UndoAction_5 = "Paste";
UndoAction_6 = "Replace";
UndoAction_7 = "Indent";
UndoAction_8 = "Shift";
UndoAction_9 = "Transliterate";
UndoAction_10 = "Transliterate";
UndoAction_11 = "Insert Line Break at Wrap Position";
UndoAction_12 = "Drag&Drop";
UndoAction_13 = "AppleEvent";
UndoAction_14 = "Rectangle Delete";
UndoAction_15 = "Rectangle Cut";
UndoAction_16 = "Rectangle Paste";
UndoAction_17 = "Rectangle Drag&Drop";
UndoAction_18 = "Tool";
UndoAction_19 = "Replace";
UndoAction_20 = "Changes by Other Application";
UndoAction_21 = "Completion";
UndoAction_22 = "Input Corresponding Text";
UndoAction_Undo = "Undo ^0";
UndoAction_Redo = "Redo ^0";
UndoAction_UndoDisabled = "Undo";
UndoAction_RedoDisabled = "Redo";
UndoAction_GeneralUndo = "Undo";
UndoAction_GeneralRedo = "Redo";

/* Find Cache Menu */
FindCacheMenu_Find = "Recently Used Text";
FindCacheMenu_Replace = "Recently Used Text";

MultiFileFind_RecentlyUsedFindString = "Recently Used Text";
MultiFileFind_RecentlyUsedFileFilter = "Recently Used Filter";
MultiFileFind_RecentlyUsedUsedFolder = "Recently Searched Folder";

/* Context Menu for Text View */
CMText_Paste = "Paste \"^0\"";
CMText_Find = "Find \"^0\"";
CMText_FindNext = "Next \"^0\"";
CMText_FindPrev = "Previous \"^0\"";
CMText_Fusen_New = "New Sticky...";
CMText_Fusen_Edit = "Edit Sticky...";

/* Menu Type Tool Button name */
BuiltinToolButtonName_TextEncoding = "Text Encoding";
BuiltinToolButtonName_ReturnCode = "Line Break Code";
BuiltinToolButtonName_WrapMode = "Wrap";
BuiltinToolButtonName_Mode = "Mode";
BuiltinToolButtonName_AddToolButton = "Add Toolbar Button";
BuiltinToolButtonName_ModeSetup = "Mode Preference";

/* Menu Type Tool Button wrap mode title */
BuiltinToolButtonTitle_WordWrap = "Window Width";
BuiltinToolButtonTitle_WordWrapWithLetterCount = "^0 Characters";

/* Recently Menus */
RecentlyMenus_DeleteAll = "Clear Menu Items";

/* Recently Opened File */
RecentlyOpenedFile_FileNotFound = "(Not Found)";

/* FTP Folder */
FTPFolderDepth = " （^0 levels）";

/* New FTP File */
FTPFolder_NewFile = "New File...";
FTPFolder_Update = "Update Folder";


/* ======================================================== */
/*				Dialog Messages								*/
/* ======================================================== */

/* File Save Error */
FileSaveError_DiskFull_A = "Failed to Save File";
FileSaveError_DiskFull_B = "Could not save file because disk or volume is full. Make space in the volume, or save into another volume.";
FileSaveError_Other_A = "Failed to Save File";
FileSaveError_Other_B = "Could not save file. Possible reasons are as follows.\r- Other application opened the same file.\r- Write permission is lost.\r- Volume is unmounted.\rIf you cannot save the file, try saving to a different file or volume by selecting [File -> Save As...] menu.";

FileSaveError_WritePermision1 = "Failed to Save File";
FileSaveError_WritePermision2 = "Could not save file. You do not have write permission now.";

FileSave_ConvertedToUTF8_1 = "Failed to Convert Text Encoding";
FileSave_ConvertedToUTF8_2 = "Saved with UTF-8 because there are characters which cannot be converted to the original encoding.";

FileSaveError_FTPLocalBackupError1 = "Failed to backup FTP in Local Folder";
FileSaveError_FTPLocalBackupError2 = "Specified folder does not exist. Confirm FTP setting by Preference Window.";

/* Find Result */
FindResult_MultiFileFindResult1 = "Multi-File Find Result (^0)";
FindResult_MultiFileFindResult2 = "Find Text: \"^0\"^1  Path: \"^2\" ";
FindResult_MultiFileFindResult3 = "File Name Filter: \"^1\"";
FindResult_RegExp = "(Regular Expression)";
FindResult_Paragraph = "Paragraph: ";
FindResult_FindResult1 = "Find Result (^0)";
FindResult_FindResult2 = "Find Text: \"^0\"^1 ";

/* Replace Result */
ReplaceResult_Message1 = "^0 Texts are Replaced";
ReplaceResult_Message2 = "Find Target: ^0\rFind Text: ^1\rReplace Text: ^2";

/* RegExp Error */
RegExpError1 = "Regular Expression Description Error";
RegExpError2 = "Regular Expression \"^0\" has error.\r- Use \\ for escape string.\r- Confirm ( ) balances are correct.\r- Any character is needed after range description\"-\"";

/* MultiFileFind Aborted */
MultiFileFind_Aborted = "This search is aborted on the way.";
MultiFileFind_ResultCount = "^0 Items are Found in ^1 Files.";

/* Preference Window */
Preference_FTPAccountYesNo1 = "Delete FTP Account";
Preference_FTPAccountYesNo2 = "Do you really want to delete the selected FTP account data?";

/* Mode Preference Window */
ModePref_SaveKeywordSheet1 = "Confirmation for Save Changes";
ModePref_SaveKeywordSheet2 = "Keyword data is changed. Do you want to save changes?";
ModePref_SaveKeywordSheet3 = "Save";

ModePref_SaveToolSheet1 = "Confirmation for Save Changes";
ModePref_SaveToolSheet2 = "Tool content is changed. Do you want to save changes?";
ModePref_SaveToolSheet3 = "Save";

ModePref_DeleteCategory1 = "Delete Keyword Category";
ModePref_DeleteCategory2 = "Do you want to delete keyword category \"^0\" and all keywords included in the category? This operation cannot be undo.";
ModePref_DeleteCategory3 = "Delete";

ModePref_DeleteJumpSetup1 = "Delete Header Menu / List Setting Item";
ModePref_DeleteJumpSetup2 = "Do you really want to delete item \"^0\"? This operation cannot be undo.";
ModePref_DeleteJumpSetup3 = "Delete";

ModePref_DeleteGeneral1 = "Delete Item";
ModePref_DeleteGeneral2 = "Do you really want to delete the selected item? This operation cannot be undo.";
ModePref_DeleteGeneral3 = "Delete";

ModePref_DeleteToolRemove1 = "Delete Tool / Toolbar item";
ModePref_DeleteToolRemove2 = "Do you really want to delete the selected item? This operation cannot be undo. The deleted file / folder will be moved to Trash.";
ModePref_DeleteToolRemove3 = "Delete";

ModePref_Revert1 = "Revert Mode Preferences (excluding Tools) to Setting when mi was Launched";
ModePref_Revert2 = "Do you really want to revert mode preferences (excluding Tools) to the setting when mi was launched? This operation cannot be undo. Current mode preference file will be moved to Trash.";
ModePref_Revert3 = "Revert";
ModePref_RevertError1 = "Could not revert mode preferences to the setting when mi was launched";
ModePref_RevertError2 = "Sorry but mode preference could not be reverted to the setting when mi was launched.";

/* Modify Text Encoding */
ModifyTextEncoding_Title1 = "Reload by Changing Text Encoding";
ModifyTextEncoding_Title2 = "Reload from file\rwith another Text Encoding.\rSelect Text Encoding from menu.";
CannotDecideTextEncoding_Title1 = "Text Encoding cannot be Decided";
CannotDecideTextEncoding_Title2 = "Reload from file with another Text Encoding.\rSelect Text Encoding from the following menu.";

/* FTP Progress */
FTPProgress_GetDirectory = "Downloading Remote Directory Information";
FTPProgress_GetFile = "Downloading Remote File";
FTPProgress_PutFile = "Uploading Remote File";
FTPProgress_Cancel = "Abort";
FTPProgress_OK = "OK";
FTPProgress_Error = "Remote File Access is aborted by the following Error.";

/* Ask Save */
AskSave = "\"^0\" is Changed. Do you Save Changes?";

/* Ask Reload Edit By Other App */
AskEditByOtherApp = "\"^0\" is changed by another Application.";

/* Delete Tool Button */
TextWindow_DeleteToolButton1 = "Delete Macro";
TextWindow_DeleteToolButton2 = "Do you really want to delete this Macro? This operation cannot be undo. The deleted Macro will be moved to Trash.";
TextWindow_DeleteToolButton3 = "Delete";

/* Progress */
Progress_Aborting = "Aborting";

/* Save failed by replace error */
SaveFailed_ReplaceError1 = "Failed to Save File";
SaveFailed_ReplaceError2 = "Could not save file because the file cannot be replaced.";

/* Charset save alert */
CharsetCheck_Error1 = "Text Encoding Error?";
CharsetCheck_Error2 = "File is already saved with the specified text encoding, but it does not match with charset / encoding in the text. Garbled characters may be shown in browser.";

/* Big File Alert */
BigFileAlert_File = "File: \"^0\"   Data Size: ^1 bytes\r";

/* SDF Error */
SDFError1 = "Syntax Definition Script Error";
SDFError2 = "There is an error in the Syntax Definition Script.\rLine ^0: ^1";

/* ======================================================== */
/*				Control Strings								*/
/* ======================================================== */

/* LineNumber Button */
LineNumberButton_Line = "Line: ";
LineNumberButton_Paragraph = "Paragraph: ";

/* Find Window */
FindWindow_ReplaceNext = "Replace Next";
FindWindow_ReplaceAfterCaret = "Replace after Caret";
FindWindow_ReplaceInSelection = "Replace in Selected Text";
FindWindow_ReplaceAll = "Replace All";
FindWindow_FindMemoryYesNo1 = "Delete Find Memory";
FindWindow_FindMemoryYesNo2 = "Do you really want to delete the selected find memory?";
FindWindow_FindMemoryInitialName = "->";

/* FileList Window */
FileListWindow_RecentFile = "Recently Opened File";
FileListWindow_SameFolder = "Same Folder File";
FileListWindow_SameProject = "Same Project File";
FileListWindow_RemoteFile = "Remote File";
FileListWindow_ProjectFolderNotDefined = "Project Folder is not set";

/* Move Paragraph */
MoveParagraph1 = "Paragraph: ";

/* Sort Button */
Sort = "Sort";

/* Identifier Info Window */
IdInfo_DisplayCommentButton = "Show COmment";
IdInfo_FixDisplayButton = "Fix Display";

/* Sub Pane */
SubPaneMode_SameDocument = "Auto: Same Tab";
SubPaneMode_PreviousDocument = "Auto: Previous";
SubPaneMode_Manual = "Manual Mode";
SubPaneSyncButton = "Display";
SubPaneSwapButton = "Swap";

/* Keybind */
Keybind_key0 = "A";
Keybind_key1 = "B";
Keybind_key2 = "C";
Keybind_key3 = "D";
Keybind_key4 = "E";
Keybind_key5 = "F";
Keybind_key6 = "G";
Keybind_key7 = "H";
Keybind_key8 = "I";
Keybind_key9 = "J";
Keybind_key10 = "K";
Keybind_key11 = "L";
Keybind_key12 = "M";
Keybind_key13 = "N";
Keybind_key14 = "O";
Keybind_key15 = "P";
Keybind_key16 = "Q";
Keybind_key17 = "R";
Keybind_key18 = "S";
Keybind_key19 = "T";
Keybind_key20 = "U";
Keybind_key21 = "V";
Keybind_key22 = "W";
Keybind_key23 = "X";
Keybind_key24 = "Y";
Keybind_key25 = "Z";
Keybind_key26 = "F1";
Keybind_key27 = "F2";
Keybind_key28 = "F3";
Keybind_key29 = "F4";
Keybind_key30 = "F5";
Keybind_key31 = "F6";
Keybind_key32 = "F7";
Keybind_key33 = "F8";
Keybind_key34 = "F9";
Keybind_key35 = "F10";
Keybind_key36 = "F11";
Keybind_key37 = "F12";
Keybind_key38 = "F13";
Keybind_key39 = "F14";
Keybind_key40 = "F15";
Keybind_key41 = "return";
Keybind_key42 = "tab";
Keybind_key43 = "space";
Keybind_key44 = "esc";
Keybind_key45 = "enter";
Keybind_key46 = "delete(BS)";
Keybind_key47 = "delete";
Keybind_key48 = "up";
Keybind_key49 = "down";
Keybind_key50 = "left";
Keybind_key51 = "right";
Keybind_key52 = ":";
Keybind_key53 = ";";
Keybind_key54 = "-";
Keybind_key55 = "^";
Keybind_key56 = "\\";
Keybind_key57 = "@";
Keybind_key58 = "[";
Keybind_key59 = "]";
Keybind_key60 = ",";
Keybind_key61 = ".";
Keybind_key62 = "/";
Keybind_key63 = "home";
Keybind_key64 = "end";
Keybind_key65 = "page up";
Keybind_key66 = "page down";
Keybind_key67 = "1";
Keybind_key68 = "2";
Keybind_key69 = "3";
Keybind_key70 = "4";
Keybind_key71 = "5";
Keybind_key72 = "6";
Keybind_key73 = "7";
Keybind_key74 = "8";
Keybind_key75 = "9";
Keybind_key76 = "0";

/* Keybind Action */
Keybind_action0 = "No Action";
Keybind_action1 = "Insert Text";
Keybind_action2 = "Line Break ( No Indent )";
Keybind_action3 = "Line Break ( Indent at Current Line and New Line )";
Keybind_action4 = "Tab";
Keybind_action5 = "Indent / Tab  ( Indent for Beginning of Line / Tab> for others )";
Keybind_action6 = "Space";
Keybind_action7 = "Completion Input ( Next )";
Keybind_action8 = "Completion Input ( Previous )";
Keybind_action9 = "Delete ( Next Character )";
Keybind_action10 = "Delete ( Previous Character )";
Keybind_action11 = "Delete ( To End of Line )";
Keybind_action12 = "Move Caret ( Up )";
Keybind_action13 = "Move Caret ( Down )";
Keybind_action14 = "Move Caret ( Left )";
Keybind_action15 = "Move Caret ( Right )";
Keybind_action16 = "Move Caret ( Beginning of Document )";
Keybind_action17 = "Move Caret ( End of Document )";
Keybind_action18 = "Move Caret ( Beginning of Line )";
Keybind_action19 = "Move Caret ( End of Line )";
Keybind_action20 = "Select ( Up )";
Keybind_action21 = "Select ( Down )";
Keybind_action22 = "Select ( Left )";
Keybind_action23 = "Select ( Right )";
Keybind_action24 = "Scroll ( Previous Page )";
Keybind_action25 = "Scroll ( Next Page )";
Keybind_action26 = "Scroll ( Beginning of Document )";
Keybind_action27 = "Scroll ( End of Document )";
Keybind_action28 = "Scroll ( Up )";
Keybind_action29 = "Scroll ( Down )";
Keybind_action30 = "Scroll ( Right )";
Keybind_action31 = "Scroll ( Left )";
Keybind_action32 = "Move Caret ( Beginning of Previous Word )";
Keybind_action33 = "Move Caret ( End of Next Word )";
Keybind_action34 = "Move Caret ( Previous Page )";
Keybind_action35 = "Move Caret ( Next Page )";
Keybind_action36 = "Undo";
Keybind_action37 = "Cut";
Keybind_action38 = "Copy";
Keybind_action39 = "Paste";
Keybind_action40 = "Cut ( To Line End )";
Keybind_action41 = "Redo";
Keybind_action42 = "Select ( To End of Next Word";
Keybind_action43 = "Select ( To Beginning of Previous Word";
Keybind_action44 = "Input Balance Text";
Keybind_action45 = "Scroll so that Caret becomes Center of Window";
Keybind_action46 = "Select ( To Beginning of Document )";
Keybind_action47 = "Select ( To End of Document )";
Keybind_action48 = "Select ( To Beginning of Line )";
Keybind_action49 = "Select ( To End of Line )";
Keybind_action50 = "Select Mode";
Keybind_action51 = "Cut ( To Beginning of Line )";
Keybind_action52 = "Select in Parenthesis";
Keybind_action53 = "Insert Same Character as Previous Line";
Keybind_action54 = "Duplicate Line";
Keybind_action55 = "Insert Empty Line";
Keybind_action56 = "Move Caret ( Beginning of Previous Word / Beginning of Line )";
Keybind_action57 = "Move Caret ( End of Next Word / End of Line )";
Keybind_action58 = "Select ( To Beginning of Previous Word / Beginning of Line )";
Keybind_action59 = "Select ( To End of Next Word / End of Line )";
Keybind_action60 = "Move Caret ( Beginning of Paragraph )";
Keybind_action61 = "Move Caret ( End of paragraph )";
Keybind_action62 = "Delete ( To End of Paragraph. Delete Line Break Code if End. )";
Keybind_action63 = "Cut ( To End of Paragraph. Cut Line Break Code if End. )";
Keybind_action64 = "Additional Cut ( To End of Paragraph. Cut Line Break Code if End. )";
Keybind_action65 = "Additional Cut";
Keybind_action66 = "Additional Copy";
Keybind_action67 = "Move Caret ( Previous Changed Point )";
Keybind_action68 = "Move Caret ( Next Changed Point )";
Keybind_action69 = "Show Identifier Info";
Keybind_action70 = "Delete ( Whole Paragraph )";
Keybind_action71 = "Indent";
Keybind_action72 = "Tab <always use Space>";
Keybind_action73 = "Indent / Tab  ( Indent for Beginning of Line <always use Space> / Tab> for others )";
Keybind_action74 = "Indent / Tab  ( Indent for Beginning of Line <always use Space> / Tab> for others <always use Space> )";
Keybind_action75 = "Indent <always use Space>";
Keybind_action76 = "Line Break ( Indent at Current Line and New Line <always use Space> )";
Keybind_action77 = "Line Break ( Indent at Only New Line )";
Keybind_action78 = "Line Break ( Indent at Only New Line <always use Space> )";
Keybind_action79 = "Next Header";
Keybind_action80 = "Previous Header";
Keybind_action81 = "Switch to Next Tab";
Keybind_action82 = "Switch to Previous Tab";
Keybind_action83 = "Show Paragraph dialog";
Keybind_action84 = "Enable/Disable Automatic Indent";
Keybind_action85 = "";
Keybind_action86 = "";
Keybind_action87 = "";
Keybind_action88 = "Delete ( Previous Character, for each decomposition )";
Keybind_action89 = "Delete ( To Beginning of Line )";
Keybind_action90 = "Delete ( To Beginning of Paragraph )";
Keybind_action91 = "Delete ( To Mark Position )";
Keybind_action92 = "";
Keybind_action93 = "";
Keybind_action94 = "";
Keybind_action95 = "";
Keybind_action96 = "";
Keybind_action97 = "Select ( To Beginning of Paragraph )";
Keybind_action98 = "";
Keybind_action99 = "";
Keybind_action100 = "Select All";
Keybind_action101 = "Select ( Whole Line )";
Keybind_action102 = "Select ( Whole Paragraph )";
Keybind_action103 = "Select ( To Mark Position )";
Keybind_action104 = "Select ( Whole Word )";
Keybind_action105 = "Set Mark Position";
Keybind_action106 = "Swap between Mark and Selection";
Keybind_action107 = "";
Keybind_action108 = "Yank";
Keybind_action109 = "Select ( To End of Paragraph )";
Keybind_action110 = "マクロ 1";
Keybind_action111 = "マクロ 2";
Keybind_action112 = "マクロ 3";
Keybind_action113 = "マクロ 4";
Keybind_action114 = "マクロ 5";
Keybind_action115 = "マクロ 6";
Keybind_action116 = "マクロ 7";
Keybind_action117 = "マクロ 8";
Keybind_action118 = "マクロ 9";
Keybind_action119 = "左シフト";
Keybind_action120 = "右シフト";
Keybind_action121 = "左右の文字を入れ替え";
KeyBindAction_Default = "Default Action";
KeyBindAction_OSDefault = "OS's Default Action";

/* Keybind */
Keybind_NoChangable = "( Keybind is Fixed )";

/* Key Record */
KeyRecord_RecentlyPlay = "History";

/* ======================================================== */
/*				File Name Strings							*/
/* ======================================================== */

/* keybind old data file */
Keybind_OldDataFileName = "KeybindDataBeforeImport";

/* drag&drop old data file */
DragDrop_OldDataFileName = "DragAndDropDataBeforeImport";

/* correspond old data file */
Correspond_OldDataFileName = "BalanceTextDataBeforeImport";

/* regexp indent old data file */
RegExpIndent_OldDataFileName = "RegExpIndentDataBeforeImport";

/* keyword old data file */
Keywords_OldDataFileName = "KeywordDataBeforeImport";

/* old SDF style data file */
SyntaxDefColors_OldDataFileName = "StyleForSyntaxDefinitionDataBeforeImport";

/* export filename */
Keybind_ExportFileName = "KeybindExport";
DragDrop_ExportFileName = "DragAndDropTextExport";
Correspond_ExportFileName = "BalanceTextExport";
RegExpIndent_ExportFileName = "RegExpIndentExport";
SyntaxDefColors_ExportFileName = "StyleForSyntaxDefinitionDataExport";
Keywords_ExportFileName = "KeywordExport";
Colors_ExportFileName = "Colors.csv";

/* Folder Names */
FolderName_Template = "template";


/* ======================================================== */
/*				Data Strings								*/
/* ======================================================== */

/* Text */
Text_Yen = "¥";
Text_ZenkakuSpace = "　";

/* Return code text */
ReturnCodeText = "↓";

/* Kinsoku Default */
Kinsoku_Default = "、。，．・：；？！ー—…‥）〕］｝〉》」』】ぁぃぅぇぉっゃゅょァィゥェォッャュョ";

/* SubMenu Mark */
ExistSubMenu = "▸";
ExistParentMenu = "◂";

/* Mode Name */
StandardModeFileNameOld = "標準";
StandardModeFileName = "Normal";

/* New Text Encoding */
NewTextEncoding = "New TextEncoding";

/* Standard Tool Buttons */
StandardToolButton_Save = "Save";
StandardToolButton_FindSelected = "Find Selected Text";
StandardToolButton_Undo = "Undo";
StandardToolButton_Redo = "Redo";
StandardToolButton_FindNext = "Find Selected Text - Find Next";
StandardToolButton_FindPrev = "Find Selected Text - Find Previous";
StandardToolButton_MultiFileFindOnlyVisible = "Multi-File Find (Only Visible File)";
StandardToolButton_MultiFileFindInProjectOnlyVisible = "Multi-File Find in Project (Only Visible File)";
StandardToolButton_Indent = "Indent";
StandardToolButton_TimeStamp6 = "Time Stamp (YYMMDD)";
StandardToolButton_NavPrev = "Go Back";
StandardToolButton_NavNext = "Go Next";
StandardToolButton_Highlight = "Highlight Selected Text";
StandardToolButton_IndexWindowNext = "Next Item in Index Window";
StandardToolButton_IndexWindowPrev = "Previous Item in Index Window";
StandardToolButton_IdInfo = "Show Identifier Info";
StandardToolButton_SwitchCrossCaret = "Show/Hide Cross-Caret";
StandardToolButton_NewDocument = "New Document";
StandardToolButton_ShowHideSubPaneColumn = "Show/Hide Sub Pane Column";
StandardToolButton_ChangeFontToModeDefault = "Set to Mode Default Font & Size";
StandardToolButton_RevertFont = "Revert Font & Size";
StandardToolButton_KeyRecStart = "Start Key Recording";
StandardToolButton_KeyRecStartWithWindow = "Start Key Recording with window";
StandardToolButton_KeyRecStop = "Stop Key Recording";
StandardToolButton_KeyRecPlay = "Play Recorded Key";

/* Untitled Document Name */
UntitledDocumentName = "Untitled";

/* Amazon */
AmazonButton = "Amazon.co.jp\n(Amazon Associate)";

/* ======================================================== */
/*				Index Window Strings						*/
/* ======================================================== */

/* Title */
IndexWindow_NewGroupName = "Group";
IndexWindow_Title_New = "Index";
IndexWindow_Title_FindResult = "Find Result";
IndexWindow_Title_TexCompileLog = "TeX Compile Log";
IndexWindow_Title_TextEncodingErrors = "Unavailable Characters List for Current Text Encoding";
IndexWindow_Title_Misspell = "Misspell";

NewIndexWindowMenuItemText = "Index";

/* Text */
TextEncodingError_KishuIzon = "PC Type Dependent Character ( These characters may be garbled other PC. ) :";
TextEncodingError_HankakuKana = "Half-width Kana ( These characters may be garbled other PC. ) :";
TextEncodingError_CannotConvert = "Character which cannot be saved with the current text encoding :";

/* TeX */
TexCompileResultWindowTitle = "TeX Compile Log";



/* ======================================================== */
/*				Other Strings								*/
/* ======================================================== */

/* Application */
AppName = "mi";
AppFileName = "mi";
AppPrefFileName = "MimikakiEdit Preferences";
AppPrefFolderName = "mi3";

/* OpenCustom */
OpenCustom_TextEncodingAutomatic = "Automatic Recognition";

/* Read Only */
ReadOnly = " ( Read Only )";

/* correspond start */
Correspnd_StartLine = "Start Text Exists at Paragraph ^1 ( Line ^0 ).";

/* Text Window Header info */
Info_LastModified = " Last Modified: ";
Info_Mode = "          Mode : ";

/* file/folder select messages */
FolderSelectMessages_MultiFileFind = "Select Folder for Multi-File Find";

/* SCM */
SCMFileStateText_NotEntried = "Not In Entries";

/* Identifier Scope */
Scope_Local = "Local";
Scope_Global = "Global";

/* old CSyntaxColor name */
OldCSyntaxColor_Function1 = "関数";
OldCSyntaxColor_Function2 = "メソッド";
OldCSyntaxColor_Var1 = "変数";
OldCSyntaxColor_Var2 = "メンバ変数";
OldCSyntaxColor_Var3 = "引数";

/* ======================================================== */
/*				List View Header Strings					*/
/* ======================================================== */
AppPref_RecentlyOpenedFileComment_ListViewTitle0 = "Path";
AppPref_RecentlyOpenedFileComment_ListViewTitle1 = "Comment";

AppPref_LaunchApp_ListViewTitle1 = "Suffix";
AppPref_LaunchApp_ListViewTitle3 = "Creator";
AppPref_LaunchApp_ListViewTitle5 = "Type";
AppPref_LaunchApp_ListViewTitle6 = "shift";
AppPref_LaunchApp_ListViewTitle7 = "Application";

ModePref_DragDrop_ListViewTitle0 = "Suffix";

ModePref_Correspond_ListViewTitle0 = "Start String";
ModePref_Correspond_ListViewTitle1 = "End String";

ModePref_Indent_ListViewTitle0 = "Reg. Exp.";
ModePref_Indent_ListViewTitle1 = "Current Line";
ModePref_Indent_ListViewTitle2 = "Next Line";

ModePref_KeywordCategory_ListViewTitle0 = "Keyword Category";

ModePref_Suffix_ListViewTitle0 = "Suffix";

ModePref_ModeSelectFilePath_ListViewTitle0 = "File Path";

ModePref_KeyBind_ListViewTitle0 = "Key";
ModePref_KeyBind_ListViewTitle1 = "Action";

FindMemory_ListViewTitle1 = "Name";
FindMemory_ListViewTitle2 = "Find";
FindMemory_ListViewTitle3 = "Replace";
FindMemory_ListViewTitle4 = "Case";
FindMemory_ListViewTitle5 = "Whole";
FindMemory_ListViewTitle6 = "Fuzzy";
FindMemory_ListViewTitle7 = "RegExp";
FindMemory_ListViewTitle8 = "Loop";

/* For Windows */

/* ======================================================== */
/*				Tab Title  Strings							*/
/* ======================================================== */
apppref_Preference0 = "Display";
apppref_Preference1 = "Operation";
apppref_Preference2 = "Tab/View";
apppref_Preference3 = "Find";
apppref_Preference4 = "Menu";
apppref_Preference5 = "Text";
apppref_Preference6 = "FTP";
apppref_Preference7 = "SCM";
apppref_Preference8 = "Tool";
apppref_Preference9 = "Misc";
apppref_Preference10 = "Register";

modepref_ModePref0 = "Default";
modepref_ModePref1 = "Display";
modepref_ModePref2 = "Edit";
modepref_ModePref3 = "Open";
modepref_ModePref4 = "Save";
modepref_ModePref5 = "Syntax";
modepref_ModePref6 = "Keyword";
modepref_ModePref7 = "Header";
modepref_ModePref8 = "Support";
modepref_ModePref9 = "Indent";
modepref_ModePref10 = "Key Bind";
modepref_ModePref11 = "Tool";
modepref_ModePref12 = "Manage";


/* ======================================================== */
/*				Pop-up Menu Strings							*/
/* ======================================================== */
apppref_Preference_128_0 = "6";
apppref_Preference_128_1 = "8";
apppref_Preference_128_2 = "9";
apppref_Preference_128_3 = "9.5";
apppref_Preference_128_4 = "10";
apppref_Preference_128_5 = "10.5";
apppref_Preference_128_6 = "11";
apppref_Preference_128_7 = "12";
apppref_Preference_128_8 = "14";
apppref_Preference_128_9 = "16";
apppref_Preference_128_10 = "18";
apppref_Preference_128_11 = "24";

apppref_Preference_131_0 = "6";
apppref_Preference_131_1 = "8";
apppref_Preference_131_2 = "9";
apppref_Preference_131_3 = "9.5";
apppref_Preference_131_4 = "10";
apppref_Preference_131_5 = "10.5";
apppref_Preference_131_6 = "11";
apppref_Preference_131_7 = "12";
apppref_Preference_131_8 = "14";
apppref_Preference_131_9 = "16";
apppref_Preference_131_10 = "18";
apppref_Preference_131_11 = "24";

apppref_Preference_134_0 = "6";
apppref_Preference_134_1 = "8";
apppref_Preference_134_2 = "9";
apppref_Preference_134_3 = "9.5";
apppref_Preference_134_4 = "10";
apppref_Preference_134_5 = "10.5";
apppref_Preference_134_6 = "11";
apppref_Preference_134_7 = "12";
apppref_Preference_134_8 = "14";
apppref_Preference_134_9 = "16";
apppref_Preference_134_10 = "18";
apppref_Preference_134_11 = "24";

apppref_Preference_173_0 = "No Proxy";
apppref_Preference_173_1 = "Use FTP Proxy Server (USER user@server)";
apppref_Preference_173_2 = "Use FTP Proxy Server (USER>PASS>SITE>USER>PASS)";

apppref_Preference_220_0 = "Small";
apppref_Preference_220_1 = "Middle";
apppref_Preference_220_2 = "Big";

apppref_Preference_129_0 = "Relative to Top-Left of Parent Window";
apppref_Preference_129_1 = "Relative to Top-Right of Parent Window";

apppref_Preference_223_0 = "Windows Standard";

apppref_Preference_270_0 = "Sub Text Pane";
apppref_Preference_270_1 = "Identifier Info";
apppref_Preference_270_2 = "Header List";
apppref_Preference_270_3 = "None";

apppref_Preference_251_0 = "Depends on Current Font of Document";
apppref_Preference_251_1 = "CP932";
apppref_Preference_251_2 = "CP437";

apppref_Preference_271_0 = "Sub Text Pane";
apppref_Preference_271_1 = "Identifier Info";
apppref_Preference_271_2 = "Header List";
apppref_Preference_271_3 = "None";

apppref_Preference_272_0 = "Sub Text Pane";
apppref_Preference_272_1 = "Identifier Info";
apppref_Preference_272_2 = "Header List";
apppref_Preference_272_3 = "None";

apppref_Preference_280_0 = "Header List";
apppref_Preference_280_1 = "File List";
apppref_Preference_280_2 = "Identifier Info";
apppref_Preference_280_3 = "None";

apppref_Preference_281_0 = "Header List";
apppref_Preference_281_1 = "File List";
apppref_Preference_281_2 = "Identifier Info";
apppref_Preference_281_3 = "None";

apppref_Preference_282_0 = "Header List";
apppref_Preference_282_1 = "File List";
apppref_Preference_282_2 = "Identifier Info";
apppref_Preference_282_3 = "None";

main_MultiFileFind_200_0 = "Same Folder as Active Text Window";
main_MultiFileFind_200_1 = "Parent Folder as Active Text Window";
main_MultiFileFind_200_2 = "Same Project Folder as Active Text Window";

modepref_ModePref_107_0 = "No Wrap";
modepref_ModePref_107_1 = "Wrap with Window Width";
modepref_ModePref_107_2 = "Wrap with Characters Count";

modepref_ModePref_109_0 = "CR (Mac)";
modepref_ModePref_109_1 = "CR+LF (Windows)";
modepref_ModePref_109_2 = "LF (UNIX)";

modepref_ModePref_328_0 = "Open Dropped File";
modepref_ModePref_328_1 = "Insert File Path";
modepref_ModePref_328_2 = "Insert Relative File Path";

modepref_ModePref_562_0 = "日本語";
modepref_ModePref_562_1 = "English";
modepref_ModePref_562_2 = "Français";
modepref_ModePref_562_3 = "Deutsch";
modepref_ModePref_562_4 = "Español";
modepref_ModePref_562_5 = "Italiano";
modepref_ModePref_562_6 = "Nederlands";
modepref_ModePref_562_7 = "Svenska";
modepref_ModePref_562_8 = "Norsk Bokmål";
modepref_ModePref_562_9 = "Dansk";
modepref_ModePref_562_10 = "Suomi";
modepref_ModePref_562_11 = "Português";
modepref_ModePref_562_12 = "简体中文";
modepref_ModePref_562_13 = "繁體中文";
modepref_ModePref_562_14 = "한국어";
modepref_ModePref_562_15 = "Polski";
modepref_ModePref_562_16 = "Português (Portugal)";
modepref_ModePref_562_17 = "Русский";

modepref_ModePref_564_0 = "日本語";
modepref_ModePref_564_1 = "English";
modepref_ModePref_564_2 = "Français";
modepref_ModePref_564_3 = "Deutsch";
modepref_ModePref_564_4 = "Español";
modepref_ModePref_564_5 = "Italiano";
modepref_ModePref_564_6 = "Nederlands";
modepref_ModePref_564_7 = "Svenska";
modepref_ModePref_564_8 = "Norsk Bokmål";
modepref_ModePref_564_9 = "Dansk";
modepref_ModePref_564_10 = "Suomi";
modepref_ModePref_564_11 = "Português";
modepref_ModePref_564_12 = "简体中文";
modepref_ModePref_564_13 = "繁體中文";
modepref_ModePref_564_14 = "한국어";
modepref_ModePref_564_15 = "Polski";
modepref_ModePref_564_16 = "Português (Portugal)";
modepref_ModePref_564_17 = "Русский";

modepref_ModePref_142_0 = "Line Numer";
modepref_ModePref_142_1 = "Paragraph Number";

modepref_ModePref_144_0 = "Line Numer";
modepref_ModePref_144_1 = "Paragraph Number";

modepref_ModePref_140_0 = "5 characters";
modepref_ModePref_140_1 = "Tab Width";

main_AddToolButton_5202_0 = "Text Encoding";
main_AddToolButton_5202_1 = "Line Break Code";
main_AddToolButton_5202_2 = "Wrap";
main_AddToolButton_5202_3 = "Mode";

main_DocProp_5133_0 = "Default Setting in Mode Preferences";
main_DocProp_5133_1 = "ON";
main_DocProp_5133_2 = "OFF";

/* ======================================================== */
/*				Default Font Name							*/
/* ======================================================== */
DefaultAppFontName_Windows2000 = "ＭＳ ゴシック";
DefaultAppFontName_WindowsXP = "ＭＳ ゴシック";
DefaultAppFontName_WindowsVista = "Consolas";
DefaultAppFontName_Windows7 = "Consolas";

DefaultDialogFontName_Windows2000 = "MS UI Gothic";
DefaultDialogFontName_WindowsXP = "MS UI Gothic";
DefaultDialogFontName_WindowsVista = "MS UI Gothic";
DefaultDialogFontName_Windows7 = "Meiryo UI";


/* ================ Added by 2.0.11b3 ================ */

main_MultiFileFind_202_0 = "Regexp";
main_MultiFileFind_202_1 = "Wildcard";

/* GDI object max */
SystemResource_GDIObject1 = "Cannot open window/tab";
SystemResource_GDIObject2 = "Cannot open window or tab because of shortage of GDI objects. Please close other windows or tabs.";

/* JumpList */
JumpList = "Header List";

/* IdInfo */
IdInfo = "Identifier Info";
IdInfoHelpTag = "[Identifier^7] ^0\r[File] ^1\r[Category] ^2\r[Type] ^6\r[Parent Keyword] ^3\r[Comment] \r^4\r[Information] \r^5";

/* Standard Tool Button */
StandardToolButton_FullScreen = "Switch Full Screen Mode";
StandardToolButton_Commit = "Commit";
StandardToolButton_DiffRepository = "Diff with Repository";
StandardToolButton_PrevDiff = "Previous Diff Part";
StandardToolButton_NextDiff = "Next Diff Part";

/* Commit window */
Commit_RecentMessage = "Recently Described Message";

apppref_Preference_305_0 = "日本語";
apppref_Preference_305_1 = "English";

SubPaneDiffButton = "Diff";
SubPaneDiffButton_Repository = "Diff: Repository  (^0 items)";
SubPaneDiffButton_File = "Diff: ^0 (^1 items)";
SubPaneDiffButton_UnsavedData = "Diff Source: Unsaved Data (Diff: ^0 items)";
SubPaneDiffButton_AutoBackup = "Diff Source: Backup ^0 (Diff: ^1 items)";
SubPaneDiffButton_Clipboard = "Diff Source: Clipboard (Diff: ^0 items)";

SJIS_Error_2ndByte = "<<Error Character (No 2nd byte of Shift_JIS) >>";

DayOfWeek0 = "SUN";
DayOfWeek1 = "MON";
DayOfWeek2 = "TUE";
DayOfWeek3 = "WED";
DayOfWeek4 = "THU";
DayOfWeek5 = "FRI";
DayOfWeek6 = "SAT";
DayOfWeekLong0 = "Sunday";
DayOfWeekLong1 = "Monday";
DayOfWeekLong2 = "Tuesday";
DayOfWeekLong3 = "Wednesday";
DayOfWeekLong4 = "Thursday";
DayOfWeekLong5 = "Friday";
DayOfWeekLong6 = "Saturday";

ModifyTextEncoding_NormalFallback = "There are one or more characters which are not defined in this Text Encoding. These characters will be converted to different characters. If you save the file, information of original characters will be lost.";
ModifyTextEncoding_LosslessFallback = "There are one or more characters which are not complied with Shift_JIS. These characters are displayed as error characters with red color background. If you save the file, information of original characters will not be lost.";
TextEncodingError_ShiftJIS_No2ndByte = "There is only the 1st byte of Shift_JIS, and no 2nd byte.";

StandardToolButton_SplitView = "Split View";

ModePref_ModeUpdate1 = "Mode Update";
ModePref_ModeUpdate2 = "Do you want to update mode data? Only Tool/Toolbar/Keyword/Header made by mode creator will be updated. \rAll items created by version 2.1.12 or before are retained as \"Items made by user\". If you do not need these items, delete or disable these.";
ModePref_ModeUpdate3 = "Update";

ModePref_AutoUpdateError1 = "Automatic Update Failed";
ModePref_AutoUpdateError2 = "Failed to update mode data. It may because of network connection fail, or Update Data URL is incorrect.";

ModePref_AutoUpdateRevision = "Last Update Date/Time：^0     Current Revision:^1";

ModePref_AutoUpdate_NotYetUpdated = "(Not Updated Yet)";

ToolMenuText_AutoUpdateTool = "Tool made by mode creator (mode: ^0)";
ToolMenuText_UserTool = "Tool made by user (mode: ^0)";

ModeUpdateURLTitle0 = "Select Download URL.";
ModeUpdateURLTitle1 = "C (mimikaki.net)";
ModeUpdateURLTitle2 = "HTML (mimikaki.net)";
ModeUpdateURLTitle3 = "TEX (mimikaki.net)";
ModeUpdateURLTitle4 = "Lua (mimikaki.net)";
ModeUpdateURLTitle5 = "Perl (mimikaki.net)";
ModeUpdateURLTitle6 = "CSS (mimikaki.net)";
ModeUpdateURLTitle7 = "Headers Document (mimikaki.net)";
ModeUpdateURLTitle8 = "Japanese Manuscript (mimikaki.net)";
ModeUpdateURLTitle9 = "MASM (mimikaki.net)";
ModeUpdateURLTitle10= "TOOLCOMMAND (mimikaki.net)";
ModeUpdateURLTitle11= "SDF (mimikaki.net)";

ModeUpdateURL0 = "";
ModeUpdateURL1 = "http://www.mimikaki.net/mi/modeupdate/c/";
ModeUpdateURL2 = "http://www.mimikaki.net/mi/modeupdate/html/";
ModeUpdateURL3 = "http://www.mimikaki.net/mi/modeupdate/tex/";
ModeUpdateURL4 = "http://www.mimikaki.net/mi/modeupdate/lua/";
ModeUpdateURL5 = "http://www.mimikaki.net/mi/modeupdate/perl/";
ModeUpdateURL6 = "http://www.mimikaki.net/mi/modeupdate/css/";
ModeUpdateURL7 = "http://www.mimikaki.net/mi/modeupdate/headers/";
ModeUpdateURL8 = "http://www.mimikaki.net/mi/modeupdate/manuscript/";
ModeUpdateURL9 = "http://www.mimikaki.net/mi/modeupdate/masm/";
ModeUpdateURL10= "http://www.mimikaki.net/mi/modeupdate/toolcommand/";
ModeUpdateURL11= "http://www.mimikaki.net/mi/modeupdate/sdf/";

ModePref_AutoUpdateNow1 = "Updating Mode Data";
ModePref_AutoUpdateNow2 = "Updating mode data now.";
ModePref_AutoUpdateEnd1 = "Automatic Update Completed";
ModePref_AutoUpdateEnd2 = "Mode data is updated successfully.";

HelpTag_InfoPane_Hide = "Info Pane Column separator\rDrag : Change separator position\rDouble Click : Hide column";
HelpTag_InfoPane_Show = "Info Pane Column separator\rDouble Click : Hide column";
HelpTag_SubPane_Hide = "Sub Pane column separator\rDrag : Change separator position\rDouble Click : Hide column";
HelpTag_SubPane_Show = "Sub Pane Column separator\rDouble Click : Hide column";
HelpTag_SwapSubPaneText = "Swap contents between Sub Text Pane and Main Text Pane";
HelpTag_DisplayToSubPaneText = "Display content of Main Text Pane in Sub Text Pane";
HelpTag_ShowDiffSubPaneText = "Display/Compare repository in Sub Text Pane";
HelpTag_HideDiffSubPaneText = "Click : Hide repository";
HelpTag_SideBarAppPrefButton = "Preference for Sub Pane Column / Info Pane Column";
HelpTag_SideBarShowHideInfoPaneButton = "Show / Hide Info Pane Column";
HelpTag_SideBarShowHideSubPaneButton = "Show / Hide Sub Pane Column";
HelpTag_SideBarInfoPaneVSeparatorButton = "Change Width of Info Pane Column";
HelpTag_LineButton = "Current Line / Paragraph\rMove Line / Paragraph by click\rLine / Paragraph can be switched by mode preferences";
HelpTag_JumpButton = "Current Position (Header)";
HelpTag_FileListSameFolder = "Files in the same folder\rFolder: ^0";
HelpTag_FileListSameProject = "Files which are in the same Project Folder and same mode\rProject Folder: ^0";
HelpTag_FileListSameProject_NotDefined = "Files which are in the same Project Folder and same mode\rProject Folder: Not set\rProject Folder can be set by menu [File -> Setup Project Folder]";
HelpTag_IdInfo = "Identifier Info\rDisplay information of identifier or explanation of keyword.\rIf you click displayed identifier item, move to the definition.";
HelpTag_IdInfoFixDisplay = "Fix displayed content or cancel the fix.";
HelpTag_JumpList = "Header List displays headers defined in Header tab setting in mode preference and syntax recognition.\rIf you click a list item, the header will be selected.\rMenu of this button displays recently selected headers.";
HelpTag_SplitView = "Split view vertically";
HelpTag_CloseSplitView = "Close split view";

StandardToolButton_HandTool = "Switch Hand Tool mode";

Menu_HandTool_Show = "Set Hand Tool mode";
Menu_HandTool_Hide = "Clear Hand Tool mode";

Menu_SubPane_Show = "Show Sub Pane Column";
Menu_SubPane_Hide = "Hide Sub Pane Column";
Menu_InfoPane_Show = "Show Info Pane Column";
Menu_InfoPane_Hide = "Hide Info Pane Column";

FileFilterPresetTitle0 = "Template for File Name Filter";
FileFilterPresetTitle1 = "HTML (*.html;*.htm;*.js;*.php;*.css)";
FileFilterPresetTitle2 = "C (*.c;*.cpp;*.cp;*.h;*.m;*.mm)";

FileFilterPreset0 = "";
FileFilterPreset1 = "*.html;*.htm;*.js;*.php;*.css";
FileFilterPreset2 = "*.c;*.cpp;*.cp;*.h;*.m;*.mm";

Menu_AutoIndent_On = "Enable Automatic Indent";
Menu_AutoIndent_Off = "Disable Automatic Indent";

CommitWindow_DiffCount = "Diff: ^0 places";

TitleText_WrapCalculating = "<Calculating Line (^0 %)>  ";
TitleText_Paragraph = "  <^0 Paragraphs>";

SubWindowTitle_IdInfo = "Keyword Information";
SubWindowTitle_CandidateList = "Completion Candidate";
SubWindowTitle_CallGraf = "Source Navigation";
SubWindowTitle_Previewer = "Preview";
SubWindowTitle_TextMarker = "Text Marker";
SubWindowTitle_ClipboardHistory = "Clipboard History";
SubWindowTitle_DocInfo = "Text Information";
SubWindowTitle_ToolList = "Tool";
SubWindowTitle_JumpList = "Header List";
SubWindowTitle_JumpList_SubText = "Header List (Sub Text)";
SubWindowTitle_FindResult = "Find Result";

SearchKeyword = "Search Keyword (Partial Match)";
Filter = "Filter Search (Partial Match)";

CallGrafLevel = "Level ^0";
CallGrafLevel0 = "Header Visit History";
CallGrafLevelX = "Places which refers \"^0\""; 
CallGrafHome = "Home";

ModeSettingTitle = "Mode \"^0\" Settings";

MultiFileReplaceConfirmation1 = "Multi-File Replace";
MultiFileReplaceConfirmation2 = "Files in folder \"^0\" will be replaced. Is it really OK to execute replace? (Please confirm again whether the folder is correct.)";
MultiFileReplaceConfirmation3 = "Replace";

DocInfo_Total1 = "Total: ";
DocInfo_Total2 = " letters   ";
DocInfo_Total3 = " words   ";
DocInfo_Total4 = " paragraphs";
DocInfo_Selected1 = "Select: ";
DocInfo_Selected2 = " letters   ";
DocInfo_Selected3 = " words   ";
DocInfo_Selected4 = " paragraphs";
DocInfo_CurrentChar = "Current letter: ";
DocInfo_CurrentCharReturnCode = "Current letter: Line break";
DocInfo_HeaderPath = "Header Path: ";
DocInfo_HeaderPathTriangle = "▸";
DocInfo_HeaderPathParagraph = "Paragraph: ";
DocInfo_SelectedTextColor = "Color of selected text: ";
DocInfo_SelectedTextNumber = "Number of selected text: ";

EditProgress_Title_Find = "Executing Find";
EditProgress_Message_Find = "Now executing find process.";
EditProgress_Title_Replace = "Executing Replace";
EditProgress_Message_Replace = "Now executing replace process.";
EditProgress_Progress_Replace = "(^0 items are replaced.)";
EditProgress_Title_Undo = "Executing Undo";
EditProgress_Message_Undo = "Now executing undo process.";
EditProgress_Title_Redo = "Executing Redo";
EditProgress_Message_Redo = "Now executing redo process.";
EditProgress_Title_MultiFileReplace = "Executing Multi-File Replace";
EditProgress_Message_MultiFileReplace = "Now executing multi-file replace process.";
EditProgress_Message_BackupForMultiFileReplace = "Now executing file backup process.";
EditProgress_Title_FindList = "Executing Find";
EditProgress_Message_FindList = "Now executing find process.";
EditProgress_Title_JavaScript = "Executing JavaScript Tool";
EditProgress_Message_JavaScript = "Now executing JavaScript tool.";
EditProgress_Title_Indent = "Executing Indent";
EditProgress_Message_Indent = "Now executing indent process.";
EditProgress_Title_Correspond = "Executing Corresponding Text Find";
EditProgress_Message_Correspond = "Now executing corresponding text find process.";
EditProgress_Title_BatchReplace = "Executing Batch Replace";
EditProgress_Message_BatchReplace = "Now executing batch replace process.";
EditProgress_Title_CalcLineInfo = "Executing Line Calculation";
EditProgress_Message_CalcLineInfo = "Now executing line calculation process.";
EditProgress_Title_InitMode = "Installing Mode Data";
EditProgress_Message_InitMode = "Now installing mode data.";

UnsavedDataTitle = "前回未保存のデータ ( ^1 時点の \"^0\")";

Minute = "^1 分";
Hour = "^1 時間 ";
Day = "^1 日 ";
Month = "^1 ヶ月 ";
Year = "^1 年 ";
Before = "前";

MacroBarTitle = "マクロ：";
AddMacro = "マクロ追加";

CommandKey = "⌘";
OptionKey = "⌥";
ShiftKey = "⇧";
ControlKey = "^";

PositionButtonTitle = "見出し：";

Progress_ImportFile = "プロジェクト内のインデックスを作成中";

MacroDefaultName = "マクロ";
MacroDefaultName_Find = "検索";
MacroDefaultName_Replace = "置換";
MacroDefaultName_KeyRecord = "キー記録";

FileList_Remote_SelectServer = "サーバーを選択";

TextMarkerSelectGroup = "グループ選択";
TextMarkerTitleDefault = "デフォルトテキストハイライト";
TextMarkerNewGroup = "新規テキストハイライト";
TextMarkerEdit = "名称変更";
TextMarkerAdd = "追加";
TextMarkerRemove = "削除";
TextMarkerEmptyText = "ハイライトするテキストを\r改行で区切って入力して下さい\r";

PopupClose = "×";

Notification_FindResult_NotFoundBoth_Title = "一致する文字列は見つかりませんでした";
Notification_FindResult_NotFoundBoth = "前方にも後方にも一致する文字列はありませんでした";
Notification_FindResult_NotFoundNext_Title = "後方には一致する文字列は見つかりませんでした";
Notification_FindResult_NotFoundNext = "前方には一致する文字列が存在します";
Notification_FindResult_NotFoundPrev_Title = "前方には一致する文字列は見つかりませんでした";
Notification_FindResult_NotFoundPrev = "後方には一致する文字列が存在します";
Notification_FindResult_LineCalc_Title = "行折り返し計算中のため検索できませんでした";
Notification_FindResult_LineCalc = "行折り返し計算完了後に再度検索をお願いします";
Notification_IndentCharacterChanged_Tab = "インデント文字：タブ";
Notification_IndentCharacterChanged_Space = "インデント文字：スペース ^0 文字";
Notification_IndentCharacterChanged_Title = "モード設定のインデントのオプションを自動更新しました";
Notification_ReloadEditByOtherApp_Title = "他のアプリケーションでの編集結果を読み込みました";
Notification_ReloadEditByOtherApp = "ファイル ^0 の現在の内容を読み込みました";
Notification_Correspond = "対応文字列を入力しました";
Notification_TextEncodingFallback_Title = "現在のエンコーディングでは読み込めない文字がありました";
Notification_TextEncodingFallback = "メニュー[ドキュメント→エンコーディングを変更して再読み込み]で再読込できます。";
Notification_FIFOCopy = "FIFO クリップボードにコピーしました";
Notification_FIFOPaste = "FIFO クリップボードからペーストしました";
Notification_CurrentPaste = "次のペーストテキスト： ^0";
Notification_ReturnCodeMixedError_Title = "このファイルには複数の改行コードが混ざっています";
Notification_ReturnCodeMixedError = "保存すると改行コードを統一して保存します。";

WordsListHeader = "\"^0\"の検索結果（単語全体が一致する箇所のみ）";
WordsListHeader2 = "検索パス：^0  モード：^1";
SubWindowTitle_WordsList = "単語使用箇所検索";
WordsListSummary_ProjectFolder = "プロジェクトフォルダ内をサブフォルダも含めて検索しました。\r";
WordsListSummary_SameFolder = "同じフォルダ内（サブフォルダ含まず）を検索しました。\rプロジェクトフォルダを設定（メニュー[ファイル→プロジェクトフォルダの設定]）すると、プロジェクトフォルダ内を検索できます。\r";
WordsListSummary_WholeWord = "（単語全体として一致する箇所の検索結果です。）\r";
WordsListSummary_NoResult = "テキスト内で選択した単語の\r使用箇所（単語全体として一致する箇所）を\r検索して表示します。\r";
WordsListSummary_ImportFileProgress = "※インデックス作成中のため上記の他にも単語使用箇所がある可能性があります。";
WordsListSummary_TooManyItems = "※項目数が多いため以降の項目は省略しました。";

ModeLabel = "モード：^0";

ChooseFileMessage_CompareFile = "比較元ファイルを選択して下さい";
ChooseFileMessage_ModePrefBackgroundImageFile = "背景画像ファイルを選択して下さい";
ChooseFileMessage_SelectUserSDF = "ユーザー定義の文法定義ファイルを選択して下さい";
ChooseFileMessage_ImportKeybind = "キーバインドインポートファイルを選択して下さい";
ChooseFileMessage_ImportDragDrop = "ドラッグ＆ドロップ文字列インポートファイルを選択して下さい";
ChooseFileMessage_CorrespondDragDrop = "対応文字列インポートファイルを選択して下さい";
ChooseFileMessage_RegExpIndentDragDrop = "正規表現インデントインポートファイルを選択して下さい";
ChooseFileMessage_ImportKeyword = "キーワードインポートファイルを選択して下さい";
ChooseFileMessage_KeywordCSVFile = "キーワードを記述した CSV ファイルを選択して下さい";
ChooseFileMessage_BatchReplace = "Select file for batch replace.";
ChooseFolderMessage_AutoBackupFolder = "自動バックアップのバックアップ保存先フォルダを選択して下さい";
ChooseFolderMessage_AutoDiffWorkingFolder = "自動フォルダ比較を行うワーキングフォルダ（編集ファイルのフォルダ）を選択して下さい";
ChooseFolderMessage_AutoDiffSourceFolder = "自動フォルダ比較のソースフォルダ（比較元ファイルのフォルダ）を選択して下さい";
ChooseFolderMessage_FTPBackup = "リモートファイル保存時のローカルバックアップ保存先フォルダを選択して下さい";
ChooseFolderMessage_ModeSelectFilePath = "このモードで開くファイルのフォルダを選択して下さい";
ChooseFolderMessage_MultiFileFindSelectFolder = "マルチファイル検索を行うフォルダを選択して下さい";
ChooseFolderMessage_MultiFileFindSelectBackupFolder = "マルチファイル置換のバックアップフォルダを選択して下さい";
ChooseFolderMessage_SelectProjectFolder = "プロジェクトフォルダを選択して下さい";
ChooseFolderMessage_SelectModeFolder = "モードフォルダ（モードと同じ名前のフォルダ）を選択して下さい";
SaveCancelDiscard_Message1 = "Do you want to save the changes you made in the document \"^0\"?";
SaveCancelDiscard_Message2 = "Your changes will be lost if you don't save them.";

FileListHeader_ProjectFilter_AllFiles = "すべてのモードのファイルを表示";
FileListHeader_ProjectFilter_SameMode = "同じモード (^0) のファイルのみを表示";
FileListHeader_ProjectFilter_DiffFiles = "差分のあるファイルのみを表示";

Notification_ReplaceResult_OK_Title = "置換結果";
Notification_ReplaceResult_OK = "^0 個の文字列を置換しました";
Notification_ReplaceResult_Aborted_Title = "置換結果（中断）";
Notification_ReplaceResult_Aborted = "置換を中断しました（ ^0 個を置換済）";

Notification_UnsavedFile_Title = "前回の異常終了時に未保存のデータがありました";
Notification_UnsavedFile = "未保存データを左側、現在のファイルを右側に表示しています";

/* MultiFileReplace Result */
MultiFileReplace_Result = "^0 個の文字列を置換しました";
MultiFileReplace_Aborted = "置換を途中で中断しました";
MultiFileReplace_FailSave = "一部ファイルの置換に失敗しました";
MultiFileReplace_FailSaveMessage = "下記のファイルの保存に失敗しました。（そのファイルのエンコーディングでは使用出来ない文字への置換などが考えられます。）\r";

PreviewWindow_LetterSizeButton = "文字サイズ： ^0 %";

TextMarker_DeleteButton1 = "テキストハイライトの削除";
TextMarker_DeleteButton2 = "本当にこのテキストハイライトデータを削除しても宜しいですか？この操作は取り消せません。";
TextMarker_DeleteButton3 = "削除";

Notification_FolderLabel = "\"^0\"配下のファイルです";

TB_Document = "新規";
TB_SubWindow = "サブウインドウ";
TB_Marker = "テキストハイライト";
TB_TextEncoding = "テキストエンコーディング";
TB_ReturnCode = "改行コード";
TB_WrapMode = "行折り返し";
TB_Mode = "モード";
TB_Diff = "比較";
TB_MultiFileFind = "マルチファイル検索";
TB_MultiFileFindExecute = "選択テキストをマルチファイル検索";
TB_Find = "前／次を検索";
TB_Nav = "前／次へ移動";
TB_Commit = "コミット";
TB_LayoutLeft = "左サイドバー";
TB_LayoutRight = "右サイドバー";
TB_Split = "横／縦分割";
TB_KeyRecord = "キー記録開始／停止／再生／マクロ追加";
TB_Pref = "設定";
TB_ProhibitPopup = "ポップアップ禁止";
TB_ShowHideFloating = "フローティング非表示";
TB_SearchField = "検索";

WordsListLock = "表示ロック";

SearchBoxMenu_Recent = "検索履歴";
SearchBoxMenu_Clear = "検索履歴を消去";

ShowToolBar = "Show Tool Bar";
HideToolBar = "Hide Tool Bar";

CandidateList_AndSoOn = "他";
CandidateList_Count = "候補：^0項目";
CandidateList_Key_BeforeAbbrevMode = "^1キーで補完入力";
CandidateList_Key_BeforeAbbrevMode_ArrowKeyAvailable = "^1キーまたは↑↓キーで補完入力";
CandidateList_Key_AfterAbbrevMode = "↑↓キーで候補選択、return キーで確定、esc キーでキャンセル";
CandidateList_ParentKeywordMatched = "  (親キーワード一致)";
CandidateList_FoundInHistory = "（最近補完した項目）";
CandidateList_MaxItems = "（項目数が多いため以降省略）";
CandidateList_SearchMode_Normal = "前方一致";
CandidateList_SearchMode_Partial = "部分一致";

ValidSyntaxPartAll = "All Syntax Parts";

Letter_Edit = "✏";
Letter_ParentKeyword = "◇";
Letter_ParentKeyword_Matched = "◆";

ModePref_KeywordKind_Embed = "This keyword category is embedded in this mode. The keywords are read-only, and they may be updated by upgrade of application.";
ModePref_KeywordKind_User = "You can input keywords using Edit Box or load from CSV File which describes keywords.";
ModePref_ToolKind_Embed = "このツールは、このモードに最初から組み込まれており、内容は読み込み専用です。また、アプリケーションのアップグレード時に自動更新されます。";
ModePref_ToolKind_User = "ツールメニュー選択時に、エディットボックスに入力されたテキストやコマンド（＝ツールコマンド）がドキュメントに挿入されます。";

FindList_Aborted = "この検索は途中で中止されました";
FindList_ResultCount = "以上、^0個の項目が見つかりました（ファイル：^1個）";

WordsListHelpTag = "【ファイル】^1\r【親キーワード】^2\r【見出し】^3\r【テキスト】\r^4";

KeyRecordStart = "記録開始";
KeyRecordStop = "停止";
KeyRecordPlay = "再生";
KeyRecordAddMacro = "マクロ追加";
SubWindowTitle_KeyRecord = "キー記録";

RemoteFileNewFile = "（新規ファイル）";
RemoteFileParentFolder = " （親フォルダへ移動）";

CantOpen_Title = "ファイルを開けませんでした";
CantOpen_FileSize = "ファイル \"^0\" を開けませんでした。申し訳ありませんが、100MBを超えるファイルはこのアプリケーションでは開けません。";
CantOpen_TotalFileSize = "ファイル \"^0\" を開けませんでした。他のドキュメントのトータルサイズが大きいためファイルを開くことができません。他のドキュメントを閉じてから、再度開いてみて下さい。";
CantOpen_FileNotExist = "ファイル \"^0\" を開けませんでした。ファイルが見つかりません。リムーバブルドライブが接続されていない、ネットワークが切断された、ファイルが削除されたなどの可能性があります。";
CantOpen_FileIsFolder = "ファイル \"^0\" を開けませんでした。指定されたファイルはフォルダです。";

NormalModeName_Japanese = "標準";

ModeAddedMessage = "下記のモードを新規追加しました";

Toolbar_AppPref = "アプリケーションの環境設定";
Toolbar_ModePref = "モード毎の設定";

MultiFileReplace_FileListTitle_File = "ファイル";
MultiFileReplace_FileListTitle_TextEncoding = "エンコーディング";

LastOverwrittenColors = "最後に上書きされた色データ";

ModeUpdate_SourceIsSameNameMode = "同じモード名のモードから更新";

DefaultSyntaxPartNotDirected = "自動";

TextView_FileLoading = "（ファイルをロード中です。）";

AbbrevKeyType1 = "シフト＋スペースキー";
AbbrevKeyType2 = "シフト＋タブキー";
AbbrevKeyType3 = "タブキー";
AbbrevKeyType4 = "エスケープキー";
AbbrevKeyType5 = "シフト＋エスケープキー";

AppPref_General = "General";
AppPref_SubWindows = "Sub Windows";
AppPref_Text = "Text";
AppPref_Find = "Find";
AppPref_RemoteFile = "Remote File";
AppPref_Compare = "Compare";
AppPref_Print = "Print";
AppPref_Detail = "Detail";
AppPref_Features = "Features";

ModePref_General = "General";
ModePref_Colors = "Colors";
ModePref_Edit = "Edit";
ModePref_Display = "Display";
ModePref_Keyword = "Keyword";
ModePref_Header = "Header";
ModePref_Syntax = "Syntax";
ModePref_Features = "Features";
ModePref_Indent = "Indent";
ModePref_KeyBind = "Key Bind";
ModePref_Tool = "Tool";
ModePref_Advanced = "Advanced";

TextMarker_Setup = "Setup...";

EditProgress_Title_CopyV2AppPrefFolder = "mi バージョン 2 のデータを引き継ぎ中です";
EditProgress_Message_CopyV2AppPrefFolder = "mi バージョン 2 のデータをコピーして引き継ぎ中です。（mi バージョン 3 は、バージョン 2 用の設定データには変更を加えません。）";

DefaultSkinName = "標準";

TabSetFileDefaultName = "TabSet.mitabset";
